; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image2 - mode
	thermograph0 - mode
	infrared5 - mode
	infrared4 - mode
	thermograph9 - mode
	thermograph3 - mode
	spectrograph8 - mode
	image1 - mode
	thermograph6 - mode
	spectrograph7 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation3 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph9)
	(supports instrument0 spectrograph7)
	(supports instrument0 thermograph6)
	(supports instrument0 image1)
	(supports instrument0 spectrograph8)
	(supports instrument0 thermograph3)
	(supports instrument0 infrared4)
	(supports instrument0 infrared5)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(pointing satellite0 Star7)
	(have_image Star7 spectrograph8)
	(have_image Star7 infrared4)
	(have_image Star7 thermograph3)
	(have_image Star8 infrared4)
	(have_image Star8 spectrograph7)
	(have_image Planet9 thermograph6)
	(have_image Planet9 spectrograph7)
	(have_image Planet9 thermograph3)
	(have_image Phenomenon10 spectrograph8)
	(have_image Phenomenon10 infrared5)
	(have_image Phenomenon10 image1)
	(have_image Planet11 infrared4)
	(have_image Planet11 image2)
))

)

; plan
1. (turn_to satellite0 groundstation3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 14
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 14
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 14
4. (turn_to satellite0 planet9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet9)
   goals met: 0 of 14
5. (take_image satellite0 planet9 instrument0 thermograph6)
   added: (have_image planet9 thermograph6)
   goals met: 1 of 14
6. (take_image satellite0 planet9 instrument0 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 2 of 14
7. (take_image satellite0 planet9 instrument0 spectrograph7)
   added: (have_image planet9 spectrograph7)
   goals met: 3 of 14
8. (turn_to satellite0 phenomenon10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 14
9. (take_image satellite0 phenomenon10 instrument0 spectrograph8)
   added: (have_image phenomenon10 spectrograph8)
   goals met: 4 of 14
10. (take_image satellite0 phenomenon10 instrument0 infrared5)
   added: (have_image phenomenon10 infrared5)
   goals met: 5 of 14
11. (take_image satellite0 phenomenon10 instrument0 image1)
   added: (have_image phenomenon10 image1)
   goals met: 6 of 14
12. (turn_to satellite0 planet11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet11)
   goals met: 6 of 14
13. (take_image satellite0 planet11 instrument0 image2)
   added: (have_image planet11 image2)
   goals met: 7 of 14
14. (take_image satellite0 planet11 instrument0 infrared4)
   added: (have_image planet11 infrared4)
   goals met: 8 of 14
15. (turn_to satellite0 star8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star8)
   goals met: 8 of 14
16. (take_image satellite0 star8 instrument0 infrared4)
   added: (have_image star8 infrared4)
   goals met: 9 of 14
17. (take_image satellite0 star8 instrument0 spectrograph7)
   added: (have_image star8 spectrograph7)
   goals met: 10 of 14
18. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 11 of 14
19. (take_image satellite0 star7 instrument0 infrared4)
   added: (have_image star7 infrared4)
   goals met: 12 of 14
20. (take_image satellite0 star7 instrument0 spectrograph8)
   added: (have_image star7 spectrograph8)
   goals met: 13 of 14
21. (take_image satellite0 star7 instrument0 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 14 of 14
